# -*- coding: utf-8 -*-
"""Story config.
"""
################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("nocht", "ノクト", "", 30,(1,1), "male", "SE", "me:オレ"),
        ("asahi", "アサヒ", "", 32,(1,1), "female", "SE", "me:私"),
        ## ノクト側
        ("erucco", "エルッコ", "", 45,(1,1), "male", "神父", "me:ワタシ"),
        ("irene", "アイリーン", "", 40,(1,1), "female", "上司", "me:私"),
        ("mousa", "ムサ", "", 28,(1,1), "male", "SE", "me:俺"),
        ("adonis", "アドニス", "", 35,(1,1), "male", "ゲームプランナ", "me:僕"),
        ## アサヒ側
        ("yoshi", "ヨシダ", "", 50,(1,1), "male", "上司", "me:俺"),
        ## 第三
        ("god", "外の研究者", "", 60,(1,1), "male", "研究者", "me:私"),
        )

AREAS = (
        # Tag / 名前 / x,y / 備考
        ("Finland", "フィンランド", 2456,6010,),# ヘルシンキ
        ("Tampere", "タンペレ", 2376,6149),
        ("Turku", "トゥルク", 2227,6052),
        )

STAGES = (
        # Tag / 名前 / エリア / 紹介
        ("church", "教会", "Tampere"),
        ("apart", "ノクトのアパート", "Tampere"),
        ("office", "ゲーム開発室", "Tampere"),
        ("market", "スーパー", "Tampere"),
        ("cafebar", "カフェバー", "Tampere"),
        ("lodge", "ロッジ", "Tampere"),
        ("campsite", "キャンプ場",),
        ## Tokyo
        ("labo", "ラボ", "Tokyo"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("firstmeet", "初めて遭遇した日", 2,20, 2017),
        ("summerday", "夏のある日", 8,10, 2017),
        ("autumnday", "秋のある日", 10,20, 2017),
        ("gameday1", "ゲーム制作日１", 10,22, 2017),
        ("shorttrip", "オーロラ観測旅行", 10,25, 2017),
        ("productday", "ゲーム発売日直前", 11,10, 2017),
        ("siteaurora", "オーロラ見物", 11,28, 2017),
        ("confession", "告白した日", 11,30, 2017),
        ("winterday", "冬のある日", 12,20, 2017),
        ("modifyfirst", "修正作業で泊まり込み開始日", 2,16, 2018),
        ("omenday", "世界異変の日", 2,20, 2018),
        ("modifylast", "最後の修正日", 2,23, 2018),
        ("lastday", "最後の日", 2,24, 2018),
        ## asahi
        ("startlabo", "ラボの実験日", 6,20, 2048),
        ("birthnocht", "ノクト誕生", 8,8, 2048),
        ("lastnotice", "最後通告日", 12,23, 2048),
        ("stoplabo", "ラボ停止日", 12,24, 2048),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ## Finland
        ("Hapan", "ハパンレイパ", "黒いドーナツ状のパン。ライ麦パン。スライスしてスープと"),
        ("koruppu", "コルップ", "ラスク"),
        ("pulla", "プッラ", "コーヒーにかかせない甘いパン。カルダモン入"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        )

RUBIS = (
        # Base / Rubi / Type
        )

LAYERS = (
        # Key / Title / Words
        )

